## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                        RESOURCE                                        |
|--------|----------------------------------------------------------------------------------------|
| add    | `aws_iam_policy.superset_athena_read[&quot;platform_gc_notify_production&quot;]`                 |
|        | `aws_iam_role.superset_athena_read[&quot;platform_gc_notify_production&quot;]`                   |
|        | `aws_iam_role_policy_attachment.superset_athena_read[&quot;platform_gc_notify_production&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.superset_athena_read["platform_gc_notify_production"] will be created
  + resource "aws_iam_policy" "superset_athena_read" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "SupersetAthenaRead-platform_gc_notify_production"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "athena:GetDataCatalog"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:athena:ca-central-1:257394494478:datacatalog/data-lake-production"
                      + Sid      = "AthenaDataCatalogAccess"
                    },
                  + {
                      + Action   = [
                          + "athena:StopQueryExecution",
                          + "athena:StartQueryExecution",
                          + "athena:ListWorkGroups",
                          + "athena:ListTagsForResource",
                          + "athena:ListTableMetadata",
                          + "athena:ListQueryExecutions",
                          + "athena:ListNamedQueries",
                          + "athena:ListDatabases",
                          + "athena:ListDataCatalogs",
                          + "athena:GetWorkGroup",
                          + "athena:GetTableMetadata",
                          + "athena:GetQueryResultsStream",
                          + "athena:GetQueryResults",
                          + "athena:GetQueryExecution",
                          + "athena:GetPreparedStatement",
                          + "athena:GetNamedQuery",
                          + "athena:DeletePreparedStatement",
                          + "athena:CreatePreparedStatement",
                          + "athena:BatchGetQueryExecution",
                          + "athena:BatchGetNamedQuery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AthenaRead"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-data-lake-transformed-production/*",
                          + "arn:aws:s3:::cds-data-lake-transformed-production",
                          + "arn:aws:s3:::cds-data-lake-curated-production/*",
                          + "arn:aws:s3:::cds-data-lake-curated-production",
                        ]
                      + Sid      = "S3AthenaSourceBucketRead"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-data-lake-athena-production/*",
                          + "arn:aws:s3:::cds-data-lake-athena-production",
                        ]
                      + Sid      = "S3AthenaResultBucketWrite"
                    },
                  + {
                      + Action   = [
                          + "glue:GetTables",
                          + "glue:GetTableVersions",
                          + "glue:GetTableVersion",
                          + "glue:GetTable",
                          + "glue:GetPartitions",
                          + "glue:GetPartition",
                          + "glue:GetDatabases",
                          + "glue:GetDatabase",
                          + "glue:BatchGetPartition",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:glue:ca-central-1:739275439843:table/platform_gc_notify_production/*",
                          + "arn:aws:glue:ca-central-1:739275439843:database/platform_gc_notify_production",
                          + "arn:aws:glue:ca-central-1:739275439843:catalog",
                          + "arn:aws:athena:ca-central-1:257394494478:datacatalog/data-lake-production",
                        ]
                      + Sid      = "GlueRead"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.superset_athena_read["platform_gc_notify_production"] will be created
  + resource "aws_iam_role" "superset_athena_read" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::257394494478:role/superset_ecs_task_role",
                              + "arn:aws:iam::257394494478:role/celery-worker_ecs_task_role",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "This role allows the Superset ECS task and Celery workers to read from the platform_gc_notify_production Glue database"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SupersetAthenaRead-platform_gc_notify_production"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.superset_athena_read["platform_gc_notify_production"] will be created
  + resource "aws_iam_role_policy_attachment" "superset_athena_read" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SupersetAthenaRead-platform_gc_notify_production"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

lifecycle_rule is deprecated. Use the aws_s3_bucket_lifecycle_configuration
resource instead.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
